ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/MCAN_CFG_52608000h.xml
<module name="CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CFG_SS_PID" acronym="CFG_SS_PID" offset="0" width="32" description="Revision Register. The Revision Register contains the major and minor revisions for the MCANSS.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31:30" rwaccess="R"/>
	<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit: 10 = Processors" range="29:28" rwaccess="R"/>
	<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x2272" description="Module ID" range="27:16" rwaccess="R"/>
	<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x11" description="RTL revision. Will vary depending on release." range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7:6" rwaccess="R"/>
	<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x1" description="Minor revision" range="5:0" rwaccess="R"/>
	</register><register id="CFG_SS_CTRL" acronym="CFG_SS_CTRL" offset="4" width="32" description="Control Register. The Control Register contains general control bits for the MCANSS.">
		<bitfield id="EXT_TS_CNTR_EN" width="1" begin="6" end="6" resetval="0x0" description="External TimeStamp Counter Enable" range="6" rwaccess="R/W"/>
	<bitfield id="AUTOWAKEUP" width="1" begin="5" end="5" resetval="0x0" description="Automatic Wakeup Enable" range="5" rwaccess="R/W"/>
	<bitfield id="WAKEUPREGEN" width="1" begin="4" end="4" resetval="0x0" description="Wakeup Request Enable" range="4" rwaccess="R/W"/>
	<bitfield id="DBGSUSP_FREE" width="1" begin="3" end="3" resetval="0x1" description="0-Honor Debug Suspend, 1-Disregard debug suspend" range="3" rwaccess="R/W"/>
	</register><register id="CFG_SS_STAT" acronym="CFG_SS_STAT" offset="8" width="32" description="Status Register. The Status Register provides general status bits for the MCANSS.">
		<bitfield id="EN_FDOE" width="1" begin="2" end="2" resetval="0x1" description="Enable FD configuration. Reflects the value of mcanss_enable_fdoe configuration port" range="2" rwaccess="R"/>
	<bitfield id="MMI_DONE" width="1" begin="1" end="1" resetval="0x1" description="0:Memory Initialization is in progress, 1:Memory Intialization Done" range="1" rwaccess="R"/>
	</register><register id="CFG_SS_ICS" acronym="CFG_SS_ICS" offset="12" width="32" description="Interrupt Clear Shadow Register. Write 1 to clear interrupt bits.">
		<bitfield id="ICS" width="1" begin="0" end="0" resetval="0x0" description="This bit contains the External TimeStamp Counter Overflow Interrupt status. Write '1' to clear bits. [ICS - Interrupt Clear Shadow Register]" range="0" rwaccess="W"/>
	</register><register id="CFG_SS_IRS" acronym="CFG_SS_IRS" offset="16" width="32" description="Interrupt Raw Status Register. Write 1 to set interrupt bits.">
		<bitfield id="IRS" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt status. Read raw interrupt status. [IRS - Interrupt Raw Status Register]" range="0" rwaccess="R"/>
	</register><register id="CFG_SS_IECS" acronym="CFG_SS_IECS" offset="20" width="32" description="Interrupt Enable Clear Shadow Register. Write 1 to clear interrupt enable bits.">
		<bitfield id="IECS" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt. Write '1' to clear bits. [IECS - Interrupt Enable Clear Shadow Register]" range="0" rwaccess="W"/>
	</register><register id="CFG_SS_IE" acronym="CFG_SS_IE" offset="24" width="32" description="Interrupt Enable Register. Write 1 to set interrupt bits.">
		<bitfield id="IE" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt. Write '1' to set interrupt enable. Read returns interrupt enable. [IE - Interrupt Enable Register]" range="0" rwaccess="R/W"/>
	</register><register id="CFG_SS_IES" acronym="CFG_SS_IES" offset="28" width="32" description="Interrupt Enable Status Register. Read enabled interrupts.">
		<bitfield id="IES" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt. Read Enabled Interrupts. [IES - Interrupt Enable Status]" range="0" rwaccess="R"/>
	</register><register id="CFG_SS_EOI" acronym="CFG_SS_EOI" offset="32" width="32" description="End Of Interrupt (EOI) Register. The EOI register is used to re-trigger the pulse interrupt signal to ensure that any nested interrupt events are serviced. For level interrupt signals the EOI register is not functional and must not be used.">
		<bitfield id="EOI" width="8" begin="7" end="0" resetval="0x0" description="Write with bit position of targeted interrupt. [E.g. Ext TS is bit 0].Upon write, level interrupt will clear and if unserviced interrupt counter > 1 will issue another pulse interrupt. Field values:  8'h00: EOI value for External TS interrupt  8'h01: EOI value for mcan[0] interrupt  8'h02: EOI value for mcan[1] interruptAll other values are not applicable[EOI - End Of Interrupt] " range="7:0" rwaccess="W"/>
	</register><register id="CFG_SS_EXT_TS_PS" acronym="CFG_SS_EXT_TS_PS" offset="36" width="32" description="External Timestamp Prescaler Register.">
		<bitfield id="PRESCALE" width="24" begin="23" end="0" resetval="0x0" description="External Timestamp Prescaler reload value.External Timestamp count rate is host clock rate divided by this valuewith one exception: a value of 0 has the same effect as 1 ." range="23:0" rwaccess="R/W"/>
	</register><register id="CFG_SS_EXT_TS_USIC" acronym="CFG_SS_EXT_TS_USIC" offset="40" width="32" description="External Timestamp Unserviced Interrupts Counter Register.">
		<bitfield id="EXT_TS_INTR_CNTR" width="5" begin="4" end="0" resetval="0x0" description="Number of unserviced rollover interrupts. If >1 an EOI write will issue another pulse interrupt [EXT_TS_USIC - External TImeStamp Unserviced Interrupts Counter]" range="4:0" rwaccess="R"/>
	</register><register id="CFG_CREL" acronym="CFG_CREL" offset="512" width="32" description="Core Release Register. Release dependent constant (version + date).">
		<bitfield id="REL" width="4" begin="31" end="28" resetval="0x3" description="Core Release" range="31:28" rwaccess="R"/>
	<bitfield id="STEP" width="4" begin="27" end="24" resetval="0x2" description="Step of Core Release" range="27:24" rwaccess="R"/>
	<bitfield id="SUBSTEP" width="4" begin="23" end="20" resetval="0x3" description="Sub-Step of Core Release" range="23:20" rwaccess="R"/>
	<bitfield id="YEAR" width="4" begin="19" end="16" resetval="0x8" description="Time Stamp Year" range="19:16" rwaccess="R"/>
	<bitfield id="MON" width="8" begin="15" end="8" resetval="0x6" description="Time Stamp Month" range="15:8" rwaccess="R"/>
	<bitfield id="DAY" width="8" begin="7" end="0" resetval="0x8" description="Time Stamp Day" range="7:0" rwaccess="R"/>
	</register><register id="CFG_ENDN" acronym="CFG_ENDN" offset="516" width="32" description="Endian Register. Constant 8765 4321h.">
		<bitfield id="ETV" width="32" begin="31" end="0" resetval="0x2271560481" description="Endianess test value" range="31:0" rwaccess="R"/>
	</register><register id="CFG_CUST" acronym="CFG_CUST" offset="520" width="32" description="Custom Register.">
		<bitfield id="CUST" width="32" begin="31" end="0" resetval="0x0" description="Custom" range="31:0" rwaccess="R"/>
	</register><register id="CFG_DBTP" acronym="CFG_DBTP" offset="524" width="32" description="Data Bit Timing &#38; Prescaler Register. Configuration of data phase bit timing, transmitter delay compensation enable. This register is only writable if the MCAN_CCCR[1] CCE and MCAN_CCCR[0] INIT bits are set. The CAN bit time may be programed in the range of 4 to 49 time quanta. The CAN time quantum may be programmed in the range of 1 to 32 MCAN functional clock periods. tq = (MCAN_DBTP[20-16] DBRP + 1) mtq (minimum time quantum = CAN clock period (MCAN functional clock)). The MCAN_DBTP[12-8] DTSEG1 field is the sum of Prop_Seg and Phase_Seg1. The MCAN_DBTP[7-4] DTSEG2 field is Phase_Seg2. Therefore the length of the bit time is (programmed values) [MCAN_DBTP[12-8] DTSEG1 + MCAN_DBTP[7-4] DTSEG2 + 3] tq or (functional values) [Sync_Seg + Prop_Seg + Phase_Seg1 + Phase_Seg2] tq. The Information Processing Time (IPT) is zero, meaning the data for the next bit is available at the first clock edge after the sample point. Note: With a CAN clock (MCAN functional clock) of 8 MHz, the reset value of 0000 0A33h configures the MCAN module for a data phase bit rate of 500 kbit/s. Note: The bit rate configured for the CAN FD data phase via the MCAN_DBTP register must be higher or equal to the bit rate configured for the arbitration phase via the MCAN_DBTP register.">
		<bitfield id="TDC" width="1" begin="23" end="23" resetval="0x0" description="Transmitter Delay Compensation 1'b0 = Transmitter Delay Compensation disabled 1'b1 = Transmitter Delay Compensation enabled" range="23" rwaccess="R/W"/>
	<bitfield id="DBRP" width="5" begin="20" end="16" resetval="0x0" description="Data Baud Rate Prescaler The value by which the oscillator frequency is divided for generating the bit time quanta. The bit time is built up from a multiple of this quanta. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used." range="20:16" rwaccess="R/W"/>
	<bitfield id="DTSEG1" width="5" begin="12" end="8" resetval="0x10" description="Data time segment before smaple point. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used." range="12:8" rwaccess="R/W"/>
	<bitfield id="DTSEG2" width="4" begin="7" end="4" resetval="0x3" description="Data time segment after sample point. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used." range="7:4" rwaccess="R/W"/>
	<bitfield id="DSJW" width="4" begin="3" end="0" resetval="0x3" description="Data resynchronization Jump Width. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used." range="3:0" rwaccess="R/W"/>
	</register><register id="CFG_TEST" acronym="CFG_TEST" offset="528" width="32" description="Test Register. Test mode selection. Write access to the MCAN_TEST register has to be enabled by setting the MCAN_CCCR[7] TEST bit.">
		<bitfield id="RX" width="1" begin="7" end="7" resetval="0x0" description="Receive Pin Monitors the actual value of the MCAN RX pin 1'b0 = The CAN bus is dominant 1'b1 = The CAN bus is recessive" range="7" rwaccess="R"/>
	<bitfield id="TX" width="2" begin="6" end="5" resetval="0x0" description="Control of Transmit Pin 2'b00 = Reset value, the MCAN TX pin controlled by the CAN Core, updated at the end of the CAN bit time 2'b01 = Sample Point can be monitored at the MCAN TX pin 2'b10 = Dominant ('0') level at the MCAN TX pin 2'b11 = Recessive ('1') at the MCAN TX pin" range="6:5" rwaccess="R/W"/>
	<bitfield id="LBCK" width="1" begin="4" end="4" resetval="0x0" description="Loop Back Mode 1'b0 = Reset value, Loopback Mode is disabled 1'b1 = Loopback Mode is enabled(see Test Modes)" range="4" rwaccess="R/W"/>
	</register><register id="CFG_RWD" acronym="CFG_RWD" offset="532" width="32" description="RAM Watchdog. Monitors the READY output of the Message RAM.">
		<bitfield id="WDV" width="8" begin="15" end="8" resetval="0x0" description="Watchdog Value Actual Message RAM Watchdog Counter Value." range="15:8" rwaccess="R"/>
	<bitfield id="WDC" width="8" begin="7" end="0" resetval="0x0" description="Watchdog Counter Value Start value of the Message RAM Watchdog Counter. With the reset value of 8'h0 the counter is disabled." range="7:0" rwaccess="R/W"/>
	</register><register id="CFG_CCCR" acronym="CFG_CCCR" offset="536" width="32" description="CC Control Register. Operation mode configuration.">
		<bitfield id="TXP" width="1" begin="14" end="14" resetval="0x0" description="Transmit Pause If this bit is set, the MCAN module pauses for two CAN bit times before starting the next transmission after itself has successfully transmitted a frame(see Tx Handling) . 1'b0 = Transmit pause disabled 1'b1 = Transmit pause enabled" range="14" rwaccess="R/W"/>
	<bitfield id="EFBI" width="1" begin="13" end="13" resetval="0x0" description="Edge Filtering durign Bus Integration 1'b0 = Edge filtering disabled 1'b1 = Two consecutive dominant tq required to detect an edge for hard synchronization" range="13" rwaccess="R/W"/>
	<bitfield id="PXHD" width="1" begin="12" end="12" resetval="0x0" description="Protocol Exception Handling Disable 1'b0 = Protocol exception handling enabled 1'b1 = Protocol exception handling disabled  Note: When protocol exception handling is disabled, the MCAN module will transmit an error frame when it detects a protocol exception condition." range="12" rwaccess="R/W"/>
	<bitfield id="BRSE" width="1" begin="9" end="9" resetval="0x0" description="Bit Rate Switch Enable 1'b0 = Bit rate switching for transmissions disabled 1'b1 = Bit rate switching for transmissions enabled Note: When CAN FD operation is disabled the MCAN_CCCR[8] FDOE = 1'b0, the MCAN_CCCR[9] BRSE bit is not evaluated." range="9" rwaccess="R/W"/>
	<bitfield id="FDOE" width="1" begin="8" end="8" resetval="0x0" description="FD Operation Enable  1'b0 = FD operation disabled 1'b1 = FD operation enabled" range="8" rwaccess="R/W"/>
	<bitfield id="TEST" width="1" begin="7" end="7" resetval="0x0" description="Test Mode enable 1'b0 = Normal operation. The MCAN_TEST register holds reset values. 1'b1 = Test Mode. Write access to the MCAN_TEST register enabled" range="7" rwaccess="R/W"/>
	<bitfield id="DAR" width="1" begin="6" end="6" resetval="0x0" description="Disable Automatic Regransmission 1'b0 = Automatic retransmission of messages not transmitted successfully enabled 1'b1 = Automatic retransmission disabled" range="6" rwaccess="R/W"/>
	<bitfield id="MON" width="1" begin="5" end="5" resetval="0x0" description="Bus Monitoring Mode The MCAN_CCCR[5] MON bit can only be set by the Host CPU when both MCAN_CCCR[1] CCE and MCAN_CCCR[0] INIT bits are set to 1. The bit can be reset by the Host CPU at any time. 1'b0 = Bus Monitoring Mode is disabled 1'b1 = Bus Monitoring Mode is enabled" range="5" rwaccess="R/W"/>
	<bitfield id="CSR" width="1" begin="4" end="4" resetval="0x0" description="Clock Stop Request 1'b0 = No clock stop is requested 1'b1 = Clock stop requested. When clock stop is requested, first the MCAN_CCCR[0] INIT bit and then the MCAN_CCCR[3] CSA bit will be set after all pending transfer requests have been completed and the CAN bus reached idle." range="4" rwaccess="R/W"/>
	<bitfield id="CSA" width="1" begin="3" end="3" resetval="0x0" description="Clock Stop Acknowledge 1'b0 = No clock stop acknowledged 1'b1 = The MCAN module may be set in power down by stopping MCAN interface clock and MCAN functional clock" range="3" rwaccess="R"/>
	<bitfield id="ASM" width="1" begin="2" end="2" resetval="0x0" description="Restriced Operation Mode The MCAN_CCCR[2] ASM bit can only be set by the Host CPU when both MCAN_CCCR[1] CCE and MCAN_CCCR[0] INIT bits are set to 1. The bit can be reset by the Host CPU at any time. For a description of the Restricted Operation Mode, see Restricted Operation Mode. 1'b0 = Normal CAN operation 1'b1 = Restricted Operation Mode active" range="2" rwaccess="R/W"/>
	<bitfield id="CCE" width="1" begin="1" end="1" resetval="0x0" description="Configuration Change Enable 1'b0 = The Host CPU has no write access to the protected configuration registers 1'b1 = The Host CPU has write access to the protected configuration registers (while the MCAN_CCCR[0] INIT = 1)" range="1" rwaccess="R/W"/>
	<bitfield id="INIT" width="1" begin="0" end="0" resetval="0x1" description="Initialization 1'b0 = Normal Operation 1'b1 = Initialization is started Note: Due to the synchronization mechanism between the two clock domains, there may be a delay until the value written to the MCAN_CCCR[0] INIT bit can be read back. Therefore the software has to assure that the previous value written to the MCAN_CCCR[0] INIT bit has been accepted by Reading the MCAN_CCCR[0] INIT bit before setting the MCAN_CCCR[0] INIT bit to a new value." range="0" rwaccess="R/W"/>
	</register><register id="CFG_NBTP" acronym="CFG_NBTP" offset="540" width="32" description="Nominal Bit Timing &#38; Prescaler Register. Configuration of arbitration phase bit timing. This register is only writable if the MCAN_CCCR[1] CCE and MCAN_CCCR[0] INIT bits are set. The CAN bit time may be programed in the range of 4 to 385 time quanta. The CAN time quantum may be programmed in the range of 1 to 512 MCAN functional clock periods. tq = (MCAN_NBTP[24-16] NBRP + 1) mtq. The MCAN_NBTP[15-8] NTSEG1 field is the sum of Prop_Seg and Phase_Seg1. The MCAN_NBTP[6-0] NTSEG2 field is Phase_Seg2. Therefore the length of the bit time is (programmed values) [MCAN_NBTP[15-8] NTSEG1 + MCAN_NBTP[6-0] NTSEG2 + 3] tq or (functional values) [Sync_Seg + Prop_Seg + Phase_Seg1 + Phase_Seg2] tq. The Information Processing Time (IPT) is zero, meaning the data for the next bit is available at the first clock edge after the sample point.">
		<bitfield id="NSJW" width="7" begin="31" end="25" resetval="0x3" description="Nominal Resynchronization Jump Width" range="31:25" rwaccess="R/W"/>
	<bitfield id="NBRP" width="9" begin="24" end="16" resetval="0x0" description="Nominal Baud Rate Prescaler" range="24:16" rwaccess="R/W"/>
	<bitfield id="NTSEG1" width="8" begin="15" end="8" resetval="0x10" description="Nominal Time segment before sample point" range="15:8" rwaccess="R/W"/>
	<bitfield id="NTSEG2" width="7" begin="6" end="0" resetval="0x3" description="Nominal Time segment after sample point" range="6:0" rwaccess="R/W"/>
	</register><register id="CFG_TSCC" acronym="CFG_TSCC" offset="544" width="32" description="Timestamp Counter Configuration. Timestamp counter prescaler setting, selection of internal/external timestamp vector.">
		<bitfield id="TCP" width="4" begin="19" end="16" resetval="0x0" description="Timestamp Counter Prescaler Configures the timestamp and timeout counters time unit in multiples of CAN bit times [1-16]. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used. Note: With CAN FD an external counter is required for timestamp generation. MCAN_TSCC[1-0] TSS = 2'b10" range="19:16" rwaccess="R/W"/>
	<bitfield id="TSS" width="2" begin="1" end="0" resetval="0x0" description="Timestamp Select 2'b00 = Timestamp counter value always 0 2'b01 = Timestamp counter value incremented according to the MCAN_TSCC[19-16] TCP field 2'b10 = External timestamp counter value used 2'b11 = Same as 2'b00" range="1:0" rwaccess="R/W"/>
	</register><register id="CFG_TSCV" acronym="CFG_TSCV" offset="548" width="32" description="Timestamp Counter Value.">
		<bitfield id="TSC" width="16" begin="15" end="0" resetval="0x0" description="Timestamp Counter  The internal/external Timestamp Counter value is captured on start of frame (both Rx and Tx). When the MCAN_TSCC[1-0] TSS = 2'b01, the Timestamp Counter is incremented in multiples of CAN bit times [1-16] depending on the configuration of the MCAN_TSCC[19-16] TCP field. A wrap around sets interrupt flag MCAN_IR[16] TSW. Write access resets the counter to zero. When the MCAN_TSCC[1-0] TSS = 2'b10, the MCAN_TSCV[15-0] TSC field reflects the external Timestamp Counter value. A write access has no impact. Note: A 'wrap around' is a change of the Timestamp Counter value from non-zero to zero not caused by write access to the MCAN_TSCV register." range="15:0" rwaccess="R/W"/>
	</register><register id="CFG_TOCC" acronym="CFG_TOCC" offset="552" width="32" description="Timeout Counter Configuration Configuration of timeout period, selection of timeout counter operation mode.">
		<bitfield id="TOP" width="16" begin="31" end="16" resetval="0x65535" description="Timeout Period Start value of the Timeout Counter (down-counter). Configures the Timeout Period." range="31:16" rwaccess="R/W"/>
	<bitfield id="TOS" width="2" begin="2" end="1" resetval="0x0" description="Timeout Select When operating in Continuous mode, a write to the MCAN_TOCV[15-0] TOC field presets the counter to the value configured by the MCAN_TOCC[31-16] TOP field and continues down-counting. When the Timeout Counter is controlled by one of the FIFOs, an empty FIFO presets the counter to the value configured by the MCAN_TOCC[31-16] TOP field. Down-counting is started when the first FIFO element is stored. 2'b00 = Continuous operation 2'b01 = Timeout controlled by Tx Event FIFO 2'b10 = Timeout controlled by Rx FIFO 0 2'b11 = Timeout controlled by Rx FIFO 1" range="2:1" rwaccess="R/W"/>
	<bitfield id="ETOC" width="1" begin="0" end="0" resetval="0x0" description="Enable Timeout Counter 1'b0 = Timeout Counter disabled 1'b1 = Timeout Counter enabled" range="0" rwaccess="R/W"/>
	</register><register id="CFG_TOCV" acronym="CFG_TOCV" offset="556" width="32" description="Timeout Counter Value. Read/reset timeout counter.">
		<bitfield id="TOC" width="16" begin="15" end="0" resetval="0x65535" description="Timeout Counter The Timeout Counter is decremented in multiples of CAN bit times [1-16] depending on the configuration of the MCAN_TSCC[19-16] TCP field. When decremented to zero, interrupt flag MCAN_IR[18] TOO is set and the Timeout Counter is stopped. Start and reset/restart conditions are configured via the MCAN_TOCC[2-1] TOS field." range="15:0" rwaccess="R/W"/>
	</register><register id="CFG_ECR" acronym="CFG_ECR" offset="576" width="32" description="Error Counter Register. State of Rx/Tx Error counter, CAN error logging.">
		<bitfield id="CEL" width="8" begin="23" end="16" resetval="0x0" description="CAN Error Logging The counter is incremented each time when a CAN protocol error causes the Transmit Error Counter or the Receive Error Counter to be incremented. It is reset by read access to the MCAN_ECR[23-16] CEL field. The counter stops at FFh; the next increment of the MCAN_ECR[7-0] TEC or MCAN_ECR[14-8] REC fields sets interrupt flag MCAN_IR[22] ELO." range="23:16" rwaccess="R"/>
	<bitfield id="RP" width="1" begin="15" end="15" resetval="0x0" description="Recieve Error Passive 1'b0 = The Receive Error Counter is below the error passive level of 128 1'b1 = The Receive Error Counter has reached the error passive level of 128" range="15" rwaccess="R"/>
	<bitfield id="REC" width="7" begin="14" end="8" resetval="0x0" description="Recieve Error Counter Actual state of the Receive Error Counter, values between 0 and 127." range="14:8" rwaccess="R"/>
	<bitfield id="TEC" width="8" begin="7" end="0" resetval="0x0" description="Transmit Error Counter Actual state of the Transmit Error Counter, values between 0 and 255. Note: When the MCAN_CCCR[2] ASM bit is set, the CAN protocol controller does not increment the MCAN_ECR[7-0] TEC and MCAN_ECR[14-8] REC fields when a CAN protocol error is detected, but the MCAN_ECR[23-16] CEL field is still incremented." range="7:0" rwaccess="R"/>
	</register><register id="CFG_PSR" acronym="CFG_PSR" offset="580" width="32" description="Protocol Status Register. CAN protocol controller status, transmitter delay compensation value.">
		<bitfield id="TDCV" width="7" begin="22" end="16" resetval="0x0" description="Transmitter Delay Compensation Value Position of the secondary sample point, defined by the sum of the measured delay from the MCAN TX to MCAN RX pins and the MCAN_TDCR[14-8] TDCO field. The SSP position is, in the data phase, the number of mtq between the start of the transmitted bit and the secondary sample point. Valid values are 0 to 127 mtq." range="22:16" rwaccess="R"/>
