ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/MCAN_CFG_52608000h.xml
	<bitfield id="PXE" width="1" begin="14" end="14" resetval="0x0" description="Protocol Exception Event 1'b0 = No protocol exception event occurred since last read access 1'b1 = Protocol exception event occurred" range="14" rwaccess="R"/>
	<bitfield id="RFDF" width="1" begin="13" end="13" resetval="0x0" description="Recieved a CAN FD Message This bit is set independent of acceptance filtering. 1'b0 = Since this bit was reset by the Host CPU, no CAN FD message has been received 1'b1 = Message in CAN FD format with FDF flag set has been received" range="13" rwaccess="R"/>
	<bitfield id="RBRS" width="1" begin="12" end="12" resetval="0x0" description="BRS flag of last recieved CAN FD Message This bit is set together with the MCAN_PSR[13] RFDF bit, independent of acceptance filtering. 1'b0 = Last received CAN FD message did not have its BRS flag set 1'b1 = Last received CAN FD message had its BRS flag set" range="12" rwaccess="R"/>
	<bitfield id="RESI" width="1" begin="11" end="11" resetval="0x0" description="ESI flag of last recieved CAN FD Message This bit is set together with the MCAN_PSR[13] RFDF bit, independent of acceptance filtering. 1'b0 = Last received CAN FD message did not have its ESI flag set 1'b1 = Last received CAN FD message had its ESI flag set" range="11" rwaccess="R"/>
	<bitfield id="DLEC" width="3" begin="10" end="8" resetval="0x7" description="Data Phase Last Error Code Type of last error that occurred in the data phase of a CAN FD format frame with its BRS flag set. Coding is the same as for the MCAN_PSR[2-0] LEC field. This field will be cleared to zero when a CAN FD format frame with its BRS flag set has been transferred (reception or transmission) without error." range="10:8" rwaccess="R"/>
	<bitfield id="BO" width="1" begin="7" end="7" resetval="0x0" description="Bus_Off status 1'b0 = The MCAN module is not Bus_Off 1'b1 = The MCAN module is in Bus_Off state" range="7" rwaccess="R"/>
	<bitfield id="EW" width="1" begin="6" end="6" resetval="0x0" description="Warning Status 1'b0 = Both error counters are below the Error_Warning limit of 96 1'b1 = At least one of error counter has reached the Error_Warning limit of 96" range="6" rwaccess="R"/>
	<bitfield id="EP" width="1" begin="5" end="5" resetval="0x0" description="Error Passive 1'b0 = The MCAN module is in the Error_Active state. It normally takes part in bus communication and sends an active error flag when an error has been detected 1'b1 = The MCAN module is in the Error_Passive state" range="5" rwaccess="R"/>
	<bitfield id="ACT" width="2" begin="4" end="3" resetval="0x0" description="Activity Monitors the module's CAN communication state. 2'b00 = Synchronizing - node is synchronizing on CAN communication 2'b01 = Idle - node is neither receiver nor transmitter 2'b10 = Receiver - node is operating as receiver 2'b11 = Transmitter - node is operating as transmitter Note: ACT is set to 0 by a Protocol Exception Event." range="4:3" rwaccess="R"/>
	<bitfield id="LEC" width="3" begin="2" end="0" resetval="0x7" description="Last Error Code The MCAN_PSR[2-0] LEC field indicates the type of the last error to occur on the CAN bus. This field will be cleared to0hwhen a message has been transferred (reception or transmission) without error. 3'b000 = No Error: No error occurred since the MCAN_PSR[2-0] LEC field has been reset by successful reception or transmission. 3'b001 = Stuff Error: More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed. 3'b010 = Form Error: A fixed format part of a received frame has the wrong format. 3'b011 = AckError: The message transmitted by the MCAN module was not acknowledged by another node. 3'b100 = Bit1Error: During the transmission of a message (with the exception of the arbitration field), the device wanted to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant. 3'b101 = Bit0Error: During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a dominant level (data or identifier bit logical value 0), but the monitored bus value was recessive. During Bus_Off recovery this status is set each time a sequence of 11 recessive bits has been monitored. This enables the Host CPU to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed). 3'b110 = CRCError: The CRC check sum of a received message was incorrect. The CRC of an incom-ing message does not match with the CRC calculated from the received data. 3'b111 = NoChange: Any read access to the Protocol Status Register re-initializes the MCAN_PSR[2-0] LEC field to 3'b111. When the MCAN_PSR[2-0] LEC field shows the value 3'b111, no CAN bus event was detected since the last Host CPU read access to the Protocol Status Register. Note: When a frame in CAN FD format has reached the data phase with BRS flag set, the next CAN event (error or valid frame) will be shown in the MCAN_PSR[10-8] DLEC field instead of the MCAN_PSR[2-0] LEC field. An error in a fixed stuff bit of a CAN FD CRC sequence will be shown as a Form Error, not Stuff Error." range="2:0" rwaccess="R"/>
	</register><register id="CFG_TDCR" acronym="CFG_TDCR" offset="584" width="32" description="Transmitter Delay Comensation Register. Configuration of transmitter delay compensation offset and filter window length.">
		<bitfield id="TDCO" width="7" begin="14" end="8" resetval="0x0" description="Transmitter Delay Compensation Offset Offset value defining the distance between the measured delay from the MCAN RX and MCAN TX pins and the secondary sample point. Valid values are 0 to 127 mtq 0h7Fh)." range="14:8" rwaccess="R/W"/>
	<bitfield id="TDCF" width="7" begin="6" end="0" resetval="0x0" description="Transmitter Delay Compensation Filter Window Length Defines the minimum value for the SSP position, dominant edges on the MCAN RX pin that would result in an earlier SSP position are ignored for transmitter delay measure-ment. The feature is enabled when the MCAN_TDCR[6-0] TDCF field is configured to a value greater than the MCAN_TDCR[14-8] TDCO field. Valid values are 0 to 127 mtq" range="6:0" rwaccess="R/W"/>
	</register><register id="CFG_IR" acronym="CFG_IR" offset="592" width="32" description="Interrupt Register. The flags are set when one of the listed conditions is detected (edge-sensitive). The flags remain set until the Host CPU clears them. A flag is cleared by writing a 1h to the corresponding bit position. Writing a 0h has no effect.">
		<bitfield id="ARA" width="1" begin="29" end="29" resetval="0x0" description="Access to Reserved Address" range="29" rwaccess="R/W"/>
	<bitfield id="PED" width="1" begin="28" end="28" resetval="0x0" description="Protocol Error in data Phase" range="28" rwaccess="R/W"/>
	<bitfield id="PEA" width="1" begin="27" end="27" resetval="0x0" description="Protocol Error in Arbitration Phase" range="27" rwaccess="R/W"/>
	<bitfield id="WDI" width="1" begin="26" end="26" resetval="0x0" description="Watchdog Interrupt" range="26" rwaccess="R/W"/>
	<bitfield id="BO" width="1" begin="25" end="25" resetval="0x0" description="Bus_Off Status" range="25" rwaccess="R/W"/>
	<bitfield id="EW" width="1" begin="24" end="24" resetval="0x0" description="Warning Status" range="24" rwaccess="R/W"/>
	<bitfield id="EP" width="1" begin="23" end="23" resetval="0x0" description="Error Passive" range="23" rwaccess="R/W"/>
	<bitfield id="ELO" width="1" begin="22" end="22" resetval="0x0" description="Error Logging Overflow" range="22" rwaccess="R/W"/>
	<bitfield id="BEU" width="1" begin="21" end="21" resetval="0x0" description="Bit Error Uncorrected" range="21" rwaccess="R/W"/>
	<bitfield id="BEC" width="1" begin="20" end="20" resetval="0x0" description="Bit Error Corrected" range="20" rwaccess="R/W"/>
	<bitfield id="DRX" width="1" begin="19" end="19" resetval="0x0" description="Message stored to Dedicated Rx Buffer" range="19" rwaccess="R/W"/>
	<bitfield id="TOO" width="1" begin="18" end="18" resetval="0x0" description="Timeout Occurred" range="18" rwaccess="R/W"/>
	<bitfield id="MRAF" width="1" begin="17" end="17" resetval="0x0" description="Message RAM Access Failure The flag is set, when the Rx Handler: i. has not completed acceptance filtering or storage of an accepted message until the arbitration field of the following message has been received. In this case acceptance filtering or message storage is aborted and the Rx Handler starts processing of the following message. ii. was not able to write a message to the Message RAM. In this case message storage is aborted. In both cases the FIFO put index is not updated respectively the New Data flag for a dedicated Rx Buffer is not set, a partly stored message is overwritten when the next message is stored to this location. The flag is also set when the Tx Handler was not able to read a message from the Message RAM in time. In this case message transmission is aborted. In case of a Tx Handler access failure the MCAN module is switched into Restricted Operation Mode (see Restricted Operation Mode). To leave Restricted Operation Mode, the Host CPU has to reset the MCAN_CCCR[2] ASM bit. 1'b0 = No Message RAM access failure occurred 1'b1 = Message RAM access failure occurred" range="17" rwaccess="R/W"/>
	<bitfield id="TSW" width="1" begin="16" end="16" resetval="0x0" description="Timestamp Wraparound" range="16" rwaccess="R/W"/>
	<bitfield id="TEFL" width="1" begin="15" end="15" resetval="0x0" description="Tx Event FIFO Element Lost" range="15" rwaccess="R/W"/>
	<bitfield id="TEFF" width="1" begin="14" end="14" resetval="0x0" description="Tx Event FIFO Full" range="14" rwaccess="R/W"/>
	<bitfield id="TEFW" width="1" begin="13" end="13" resetval="0x0" description="Tx Event FIFO Watermark Reached" range="13" rwaccess="R/W"/>
	<bitfield id="TEFN" width="1" begin="12" end="12" resetval="0x0" description="Tx Event FIFO New Entry" range="12" rwaccess="R/W"/>
	<bitfield id="TFE" width="1" begin="11" end="11" resetval="0x0" description="Tx FIFO Empty" range="11" rwaccess="R/W"/>
	<bitfield id="TCF" width="1" begin="10" end="10" resetval="0x0" description="Transmission Cancellation Finished" range="10" rwaccess="R/W"/>
	<bitfield id="TC" width="1" begin="9" end="9" resetval="0x0" description="Transmission Complete" range="9" rwaccess="R/W"/>
	<bitfield id="HPM" width="1" begin="8" end="8" resetval="0x0" description="High Priority Message" range="8" rwaccess="R/W"/>
	<bitfield id="RF1L" width="1" begin="7" end="7" resetval="0x0" description="Rx FIFO 1 Message Lost" range="7" rwaccess="R/W"/>
	<bitfield id="RF1F" width="1" begin="6" end="6" resetval="0x0" description="Rx FIFO 1 Full" range="6" rwaccess="R/W"/>
	<bitfield id="RF1W" width="1" begin="5" end="5" resetval="0x0" description="Rx FIFO 1 Watermark Reached" range="5" rwaccess="R/W"/>
	<bitfield id="RF1N" width="1" begin="4" end="4" resetval="0x0" description="Rx FIFO 1 New Message" range="4" rwaccess="R/W"/>
	<bitfield id="RF0L" width="1" begin="3" end="3" resetval="0x0" description="Rx FIFO 0 Message Lost" range="3" rwaccess="R/W"/>
	<bitfield id="RF0F" width="1" begin="2" end="2" resetval="0x0" description="Rx FIFO 0 Full" range="2" rwaccess="R/W"/>
	<bitfield id="RF0W" width="1" begin="1" end="1" resetval="0x0" description="Rx FIFO 0 Watermark Reached" range="1" rwaccess="R/W"/>
	<bitfield id="RF0N" width="1" begin="0" end="0" resetval="0x0" description="Rx FIFO 0 New Message" range="0" rwaccess="R/W"/>
	</register><register id="CFG_IE" acronym="CFG_IE" offset="596" width="32" description="Interrupt Enable Register. The settings in the Interrupt Enable register determine which status changes in the MCAN_IR register are signalled on an interrupt line.">
		<bitfield id="ARAE" width="1" begin="29" end="29" resetval="0x0" description="Accees to Reserve Address Interrupt Enable" range="29" rwaccess="R/W"/>
	<bitfield id="PEDE" width="1" begin="28" end="28" resetval="0x0" description="Protocol Error in Data Phase Interrupt Enable" range="28" rwaccess="R/W"/>
	<bitfield id="PEAE" width="1" begin="27" end="27" resetval="0x0" description="Protocol Error in Arbitration Phase Interrupt Enable" range="27" rwaccess="R/W"/>
	<bitfield id="WDIE" width="1" begin="26" end="26" resetval="0x0" description="Watchdog Interrupt Enable" range="26" rwaccess="R/W"/>
	<bitfield id="BOE" width="1" begin="25" end="25" resetval="0x0" description="Bus_Off Status Interrupt Enable" range="25" rwaccess="R/W"/>
	<bitfield id="EWE" width="1" begin="24" end="24" resetval="0x0" description="Warning Status Interrupt Enable" range="24" rwaccess="R/W"/>
	<bitfield id="EPE" width="1" begin="23" end="23" resetval="0x0" description="Error Passive Interrupt Enable" range="23" rwaccess="R/W"/>
	<bitfield id="ELOE" width="1" begin="22" end="22" resetval="0x0" description="Error Logging Overflow Interrupt Enable" range="22" rwaccess="R/W"/>
	<bitfield id="BEUE" width="1" begin="21" end="21" resetval="0x0" description="Bit Error Uncorrected Interrupt Enable" range="21" rwaccess="R/W"/>
	<bitfield id="BECE" width="1" begin="20" end="20" resetval="0x0" description="Bit Error Corrected Interrupt Enable" range="20" rwaccess="R/W"/>
	<bitfield id="DRX" width="1" begin="19" end="19" resetval="0x0" description="Message stored to Dedicated Rx Buffer Interrupt Enable" range="19" rwaccess="R/W"/>
	<bitfield id="TOOE" width="1" begin="18" end="18" resetval="0x0" description="Timeout Occurred Interrupt Enable" range="18" rwaccess="R/W"/>
	<bitfield id="MRAFE" width="1" begin="17" end="17" resetval="0x0" description="Message RAM Access Failure Interrupt Enable" range="17" rwaccess="R/W"/>
	<bitfield id="TSWE" width="1" begin="16" end="16" resetval="0x0" description="Timestamp Wraparound Interrupt Enable" range="16" rwaccess="R/W"/>
	<bitfield id="TEFLE" width="1" begin="15" end="15" resetval="0x0" description="Tx Event FIFO Event Lost Interrupt Enable" range="15" rwaccess="R/W"/>
	<bitfield id="TEFFE" width="1" begin="14" end="14" resetval="0x0" description="Tx Event FIFO Full Interrupt Enable" range="14" rwaccess="R/W"/>
	<bitfield id="TEFWE" width="1" begin="13" end="13" resetval="0x0" description="Tx Event FIFO Watermark Reached Interrupt enable" range="13" rwaccess="R/W"/>
	<bitfield id="TEFNE" width="1" begin="12" end="12" resetval="0x0" description="Tx Event FIFO New Entry Interrupt Enable" range="12" rwaccess="R/W"/>
	<bitfield id="TFEE" width="1" begin="11" end="11" resetval="0x0" description="Tx FIFO Empty Interrupt Enable" range="11" rwaccess="R/W"/>
	<bitfield id="TCFE" width="1" begin="10" end="10" resetval="0x0" description="Transmission Cancellation Finishied Interrupt Enable" range="10" rwaccess="R/W"/>
	<bitfield id="TCE" width="1" begin="9" end="9" resetval="0x0" description="Transmission Completed Interrupt Enable" range="9" rwaccess="R/W"/>
	<bitfield id="HPME" width="1" begin="8" end="8" resetval="0x0" description="High Priority message Interrupt Enable" range="8" rwaccess="R/W"/>
	<bitfield id="RF1LE" width="1" begin="7" end="7" resetval="0x0" description="Rx FIFO 1 Message Lost Interrupt Enable" range="7" rwaccess="R/W"/>
	<bitfield id="RF1FE" width="1" begin="6" end="6" resetval="0x0" description="Rx FIFO 1 Full Interrupt Enable" range="6" rwaccess="R/W"/>
	<bitfield id="RF1WE" width="1" begin="5" end="5" resetval="0x0" description="Rx FIFO 1 Watermark Reached Interrupt Enable" range="5" rwaccess="R/W"/>
	<bitfield id="RF1NE" width="1" begin="4" end="4" resetval="0x0" description="Rx FIFO 1 New Message Interrupt Enable" range="4" rwaccess="R/W"/>
	<bitfield id="RF0LE" width="1" begin="3" end="3" resetval="0x0" description="Rx FIFO 0 Message Lost Interrupt Enable" range="3" rwaccess="R/W"/>
	<bitfield id="RF0FE" width="1" begin="2" end="2" resetval="0x0" description="Rx FIFO 0 Full Interrupt Enable" range="2" rwaccess="R/W"/>
	<bitfield id="RF0WE" width="1" begin="1" end="1" resetval="0x0" description="Rx FIFO 0 Watermark Reached Interrupt Enable" range="1" rwaccess="R/W"/>
	<bitfield id="RF0NE" width="1" begin="0" end="0" resetval="0x0" description="Rx FIFO 0 New Message Interrupt Enable" range="0" rwaccess="R/W"/>
	</register><register id="CFG_ILS" acronym="CFG_ILS" offset="600" width="32" description="Interrupt line select. The Interrupt Line Select register assigns an interrupt generated by a specific interrupt flag from the MCAN_IR register to one of the two module interrupt lines. For assigning interrupt to INT0, write 0 to corresponding bit field and for assigning interrupt to INT1, write 1 to corresponding bit field.">
		<bitfield id="ARAL" width="1" begin="29" end="29" resetval="0x0" description="Accees to Reserve Address Interrupt Line" range="29" rwaccess="R/W"/>
	<bitfield id="PEDL" width="1" begin="28" end="28" resetval="0x0" description="Protocol Error in Data Phase Interrupt Line" range="28" rwaccess="R/W"/>
	<bitfield id="PEAL" width="1" begin="27" end="27" resetval="0x0" description="Protocol Error in Arbitration Phase Interrupt Line" range="27" rwaccess="R/W"/>
	<bitfield id="WDIL" width="1" begin="26" end="26" resetval="0x0" description="Watchdog Interrupt Line" range="26" rwaccess="R/W"/>
	<bitfield id="BOL" width="1" begin="25" end="25" resetval="0x0" description="Bus_Off Status Interrupt Line" range="25" rwaccess="R/W"/>
	<bitfield id="EWL" width="1" begin="24" end="24" resetval="0x0" description="Warning Status Interrupt Line" range="24" rwaccess="R/W"/>
	<bitfield id="EPL" width="1" begin="23" end="23" resetval="0x0" description="Error Passive Interrupt Line" range="23" rwaccess="R/W"/>
	<bitfield id="ELOL" width="1" begin="22" end="22" resetval="0x0" description="Error Logging Overflow Interrupt Line" range="22" rwaccess="R/W"/>
	<bitfield id="BEUL" width="1" begin="21" end="21" resetval="0x0" description="Bit Error Uncorrected Interrupt Line" range="21" rwaccess="R/W"/>
	<bitfield id="BECL" width="1" begin="20" end="20" resetval="0x0" description="Bit Error Corrected Interrupt Line" range="20" rwaccess="R/W"/>
	<bitfield id="DRXL" width="1" begin="19" end="19" resetval="0x0" description="Message stored to Dedicated Rx Buffer Interrupt Line" range="19" rwaccess="R/W"/>
	<bitfield id="TOOL" width="1" begin="18" end="18" resetval="0x0" description="Timeout Occurred Interrupt Line" range="18" rwaccess="R/W"/>
	<bitfield id="MRAFL" width="1" begin="17" end="17" resetval="0x0" description="Message RAM Access Failure Interrupt Line" range="17" rwaccess="R/W"/>
	<bitfield id="TSWL" width="1" begin="16" end="16" resetval="0x0" description="Timestamp Wraparound Interrupt Line" range="16" rwaccess="R/W"/>
	<bitfield id="TEFLL" width="1" begin="15" end="15" resetval="0x0" description="Tx Event FIFO Event Lost Interrupt Line" range="15" rwaccess="R/W"/>
	<bitfield id="TEFFL" width="1" begin="14" end="14" resetval="0x0" description="Tx Event FIFO Full Interrupt Line" range="14" rwaccess="R/W"/>
	<bitfield id="TEFWL" width="1" begin="13" end="13" resetval="0x0" description="Tx Event FIFO Watermark Reached Interrupt Line" range="13" rwaccess="R/W"/>
	<bitfield id="TEFNL" width="1" begin="12" end="12" resetval="0x0" description="Tx Event FIFO New Entry Interrupt Line" range="12" rwaccess="R/W"/>
	<bitfield id="TFEL" width="1" begin="11" end="11" resetval="0x0" description="Tx FIFO Empty Interrupt Line" range="11" rwaccess="R/W"/>
	<bitfield id="TCFL" width="1" begin="10" end="10" resetval="0x0" description="Transmission Cancellation Finishied Interrupt Line" range="10" rwaccess="R/W"/>
	<bitfield id="TCL" width="1" begin="9" end="9" resetval="0x0" description="Transmission Completed Interrupt Line" range="9" rwaccess="R/W"/>
	<bitfield id="HPML" width="1" begin="8" end="8" resetval="0x0" description="High Priority message Interrupt Line" range="8" rwaccess="R/W"/>
	<bitfield id="RF1LL" width="1" begin="7" end="7" resetval="0x0" description="Rx FIFO 1 Message Lost Interrupt Line" range="7" rwaccess="R/W"/>
	<bitfield id="RF1FL" width="1" begin="6" end="6" resetval="0x0" description="Rx FIFO 1 Full Interrupt Line" range="6" rwaccess="R/W"/>
	<bitfield id="RF1WL" width="1" begin="5" end="5" resetval="0x0" description="Rx FIFO 1 Watermark Reached Interrupt Line" range="5" rwaccess="R/W"/>
	<bitfield id="RF1NL" width="1" begin="4" end="4" resetval="0x0" description="Rx FIFO 1 New Message Interrupt Line" range="4" rwaccess="R/W"/>
	<bitfield id="RF0LL" width="1" begin="3" end="3" resetval="0x0" description="Rx FIFO 0 Message Lost Interrupt Line" range="3" rwaccess="R/W"/>
	<bitfield id="RF0FL" width="1" begin="2" end="2" resetval="0x0" description="Rx FIFO 0 Full Interrupt Line" range="2" rwaccess="R/W"/>
	<bitfield id="RF0WL" width="1" begin="1" end="1" resetval="0x0" description="Rx FIFO 0 Watermark Reached Interrupt Line" range="1" rwaccess="R/W"/>
	<bitfield id="RF0NL" width="1" begin="0" end="0" resetval="0x0" description="Rx FIFO 0 New Message Interrupt Line" range="0" rwaccess="R/W"/>
	</register><register id="CFG_ILE" acronym="CFG_ILE" offset="604" width="32" description="Interrupt line enable Register. Enable/Disable interrupt lines INT0/INT1.">
		<bitfield id="EINT1" width="1" begin="1" end="1" resetval="0x0" description="Enable Interrupt Line 1" range="1" rwaccess="R/W"/>
	<bitfield id="EINT0" width="1" begin="0" end="0" resetval="0x0" description="Enable Interrupt Line 0" range="0" rwaccess="R/W"/>
	</register><register id="CFG_GFC" acronym="CFG_GFC" offset="640" width="32" description="Global Filter Configuration. Handling of non-matching frames and remote frames. Global settings for Message ID filtering. The MCAN_GFC register controls the filter path for standard and extended messages.">
		<bitfield id="ANFS" width="2" begin="5" end="4" resetval="0x0" description="Accept Non-matching Frames Standard Defines how received messages with 11-bit IDs that do not match any element of the filter list are treated. 2'b00 = Accept in Rx FIFO 0 2'b01 = Accept in Rx FIFO 1 2'b10 = Reject 2'b11 = Reject" range="5:4" rwaccess="R/W"/>
	<bitfield id="ANFE" width="2" begin="3" end="2" resetval="0x0" description="Accept Non-matching Frames Extended Defines how received messages with 29-bit IDs that do not match any element of the filter list are treated. 2'b00 = Accept in Rx FIFO 0 2'b01 = Accept in Rx FIFO 1 2'b10 = Reject 2'b11 = Reject" range="3:2" rwaccess="R/W"/>
	<bitfield id="RRFS" width="1" begin="1" end="1" resetval="0x0" description="Reject Remote Frames Standard 1'b0 = Filter remote frames with 11-bit standard IDs 1'b1 = Reject all remote frames with 11-bit standard IDs" range="1" rwaccess="R/W"/>
	<bitfield id="RRFE" width="1" begin="0" end="0" resetval="0x0" description="Reject Remote Frames Extended 1'b0 = Filter remote frames with 29-bit extended IDs 1'b1 = Reject all remote frames with 29-bit extended IDs" range="0" rwaccess="R/W"/>
	</register><register id="CFG_SIDFC" acronym="CFG_SIDFC" offset="644" width="32" description="Standard ID Filter Configuration. Settings for 11-bit standard Message ID filtering. The Standard ID Filter Configuration controls the filter path for standard messages.">
		<bitfield id="LSS_S" width="8" begin="23" end="16" resetval="0x0" description="List Size Standard 8'h00 = No standard Message ID filter 8'h01-8'h80 (1-128) = Number of standard Message ID filter elements > 8'h80 (128) = Values greater than 128 are interpreted as 128" range="23:16" rwaccess="R/W"/>
	<bitfield id="FLSSA_S" width="14" begin="15" end="2" resetval="0x0" description="Filter List Standard Start Address Start address of standard Message ID filter list (32-bit word address, see Message RAM Configuration)." range="15:2" rwaccess="R/W"/>
	</register><register id="CFG_XIDFC" acronym="CFG_XIDFC" offset="648" width="32" description="Extended ID Filter Configuration. Settings for 29-bit extended Message ID filtering. The Extended ID Filter Configuration controls the filter path for standard messages.">
