ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/MCAN_CFG_52608000h.xml
		<bitfield id="LSS_X" width="8" begin="23" end="16" resetval="0x0" description="List Size Extended 8'h00 = No extended Message ID filter 8'h01-8'h40 (1-64) = Number of extended Message ID filter elements > 8'h40 (64) = Values greater than 64 are interpreted as 64" range="23:16" rwaccess="R/W"/>
	<bitfield id="FLSSA_X" width="14" begin="15" end="2" resetval="0x0" description="Filter List Extended Start Address Start address of extended Message ID filter list (32-bit word address, see Message RAM Configuration)." range="15:2" rwaccess="R/W"/>
	</register><register id="CFG_XIDAM" acronym="CFG_XIDAM" offset="656" width="32" description="Extended ID and Mask.">
		<bitfield id="EIDM" width="29" begin="28" end="0" resetval="0x536870911" description="Extended ID Mask. For acceptance filtering of extended frames the Extended ID AND Mask is ANDed with the Message ID of a received frame. Intended for masking of 29-bit IDs in SAE J1939. With the reset value of all bits set to one the mask is not active." range="28:0" rwaccess="R/W"/>
	</register><register id="CFG_HPMS" acronym="CFG_HPMS" offset="660" width="32" description="High Priority Message Status. Status monitoring of incoming high priority messages. This register is updated every time a Message ID filter element configured to generate a priority event matches. This can be used to monitor the status of incoming high priority messages and to enable fast access to these messages.">
		<bitfield id="FLST" width="1" begin="15" end="15" resetval="0x0" description="Filter List Indicates the filter list of the matching filter element. 1'b0 = Standard Filter List 1'b1 = Extended Filter List" range="15" rwaccess="R"/>
	<bitfield id="FIDX" width="7" begin="14" end="8" resetval="0x0" description="Filter Index Index of matching filter element. Range is 0 to MCAN_SIDFC[23-16] LSS - 1 respectively MCAN_XIDFC[22-16] LSE - 1." range="14:8" rwaccess="R"/>
	<bitfield id="MSI" width="2" begin="7" end="6" resetval="0x0" description="Message Storeage Indicator 2'b00 = No FIFO selected 2'b01 = FIFO message lost 2'b10 = Message stored in FIFO 0 2'b11 = Message stored in FIFO 1" range="7:6" rwaccess="R"/>
	<bitfield id="BIDX" width="6" begin="5" end="0" resetval="0x0" description="Buffer Index Index of Rx FIFO element to which the message was stored. Only valid when the MCAN_HPMS[7-6] MSI = 1." range="5:0" rwaccess="R"/>
	</register><register id="CFG_NDAT1" acronym="CFG_NDAT1" offset="664" width="32" description="New Data 1 register. NewData flags of dedicated Rx buffers 0-31. The register holds the New Data flags of Rx Buffers 0 to 31. The flags are set when the respective Rx Buffer has been updated from a received frame. The flags remain set until the Host CPU clears them. Aflag is cleared by writing a 1h to the corresponding bit position. Writing a 0h has no effect. A hard reset will clear the register .">
		<bitfield id="ND0_31" width="32" begin="31" end="0" resetval="0x0" description="New Data 31-0" range="31:0" rwaccess="R/W"/>
	</register><register id="CFG_NDAT2" acronym="CFG_NDAT2" offset="668" width="32" description="New Data 2 register. NewData flags of dedicated Rx buffers 32-63. The register holds the New Data flags of Rx Buffers 32 to 63. The flags are set when the respective Rx Buffer has been updated from a received frame. The flags remain set until the Host CPU clears them. A flag is cleared by writing a 1h to the corresponding bit position. Writing a 0h has no effect. A hard reset will clear the register .">
		<bitfield id="ND32_63" width="32" begin="31" end="0" resetval="0x0" description="New Data 63-32" range="31:0" rwaccess="R/W"/>
	</register><register id="CFG_RXF0C" acronym="CFG_RXF0C" offset="672" width="32" description="Rx FIFO 0 Configuration register. FIFO 0 operation mode, watermark, size and start address.">
		<bitfield id="F0OM" width="1" begin="31" end="31" resetval="0x0" description="Rx FIFO 0 Operation Mode FIFO 0 can be operated in blocking or in overwrite mode (see Rx FIFOs). 1'b0 = FIFO 0 blocking mode 1'b1 = FIFO 0 overwrite mode" range="31" rwaccess="R/W"/>
	<bitfield id="F0WM" width="7" begin="30" end="24" resetval="0x0" description="Rx FIFO 0 Watermark 7'h00 = Watermark interrupt disabled 7'h01-7'h40 (1-64) = Level for Rx FIFO 0 watermark interrupt (MCAN_IR[1] RF0W) > 7'h40 (64) = Watermark interrupt disabled" range="30:24" rwaccess="R/W"/>
	<bitfield id="F0S" width="7" begin="22" end="16" resetval="0x0" description="Rx FIFO 0 Size 7'h00 = No Rx FIFO 0 7'h01-7'h40 (1-64) = Number of Rx FIFO 0 elements > 7'h40 (64) = Values greater than 64 are interpreted as 64 The Rx FIFO 0 elements are indexed from 0 to MCAN_RXF0C[22-16] F0S - 1." range="22:16" rwaccess="R/W"/>
	<bitfield id="F0SA" width="13" begin="14" end="2" resetval="0x0" description="Rx FIFO 0 Start Address Start address of Rx FIFO 0 in Message RAM (32-bit word address, see Message RAM Configuration)." range="14:2" rwaccess="R/W"/>
	</register><register id="CFG_RXF0S" acronym="CFG_RXF0S" offset="676" width="32" description="Rx FIFO 0 Status register. FIFO 0 message lost/full indication, put index, get index and fill level.">
		<bitfield id="RF0L" width="1" begin="25" end="25" resetval="0x0" description="Rx FIFO 0 Message Lost This bit is a copy of interrupt flag MCAN_IR[3] RF0L. When the MCAN_IR[3] RF0L flag is reset, this bit is also reset. 1'b0 = No Rx FIFO 0 message lost 1'b1 = Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of size zero Note: OverWriting the oldest message when the MCAN_RXF0C[31] F0OM = 1'b1 will not set this flag." range="25" rwaccess="R"/>
	<bitfield id="F0F" width="1" begin="24" end="24" resetval="0x0" description="Rx FIFO 0 Full" range="24" rwaccess="R"/>
	<bitfield id="F0PI" width="6" begin="21" end="16" resetval="0x0" description="Rx FIFO 0 Put Index" range="21:16" rwaccess="R"/>
	<bitfield id="F0GI" width="6" begin="13" end="8" resetval="0x0" description="Rx FIFO 0 Get Index" range="13:8" rwaccess="R"/>
	<bitfield id="F0FL" width="7" begin="6" end="0" resetval="0x0" description="Rx FIFO 0 Fill Level" range="6:0" rwaccess="R"/>
	</register><register id="CFG_RXF0A" acronym="CFG_RXF0A" offset="680" width="32" description="Rx FIFO 0 Acknowledge register. FIFO 0 acknowledge last index of read buffers, updates get index and fill level.">
		<bitfield id="F0AI" width="6" begin="5" end="0" resetval="0x0" description="Rx FIFO 0 Acknowledge Index After the Host CPU has read a message or a sequence of messages from Rx FIFO 0 it has to write the buffer index of the last element read from Rx FIFO 0 to the MCAN_RXF0A[5-0] F0AI field. This will set the Rx FIFO 0 Get Index MCAN_RXF0S[13-8] F0GI field to the MCAN_RXF0A[5-0] F0AI field + 1 and update the FIFO 0 Fill Level MCAN_RXF0S[6-0] F0FL field." range="5:0" rwaccess="R/W"/>
	</register><register id="CFG_RXBC" acronym="CFG_RXBC" offset="684" width="32" description="Rx Buffer Configuration register. Start address of Rx buffer section.">
		<bitfield id="RBSA" width="14" begin="15" end="2" resetval="0x0" description="Rx Buffer Start Address" range="15:2" rwaccess="R/W"/>
	</register><register id="CFG_RXF1C" acronym="CFG_RXF1C" offset="688" width="32" description="Rx FIFO 1 Configuration register. FIFO 1 operation mode, watermark, size and start address.">
		<bitfield id="F1OM" width="1" begin="31" end="31" resetval="0x0" description="Rx FIFO 1 Operation Mode FIFO 1 can be operated in blocking or in overwrite mode (see Rx FIFOs). 1'b0 = FIFO 1 blocking mode 1'b1 = FIFO 1 overwrite mode" range="31" rwaccess="R/W"/>
	<bitfield id="F1WM" width="7" begin="30" end="24" resetval="0x0" description="Rx FIFO 1 Watermark 7'h00 = Watermark interrupt disabled 7'h01-7'h40 (1-64) = Level for Rx FIFO 1 watermark interrupt (MCAN_IR[5] RF1W) > 7'h40 (64) = Watermark interrupt disabled" range="30:24" rwaccess="R/W"/>
	<bitfield id="F1S" width="7" begin="22" end="16" resetval="0x0" description="Rx FIFO 1 Size 7'h00 = No Rx FIFO 1 7'h01-7'h40 (1-64) = Number of Rx FIFO 1 elements > 7'h40 (64) = Values greater than 64 are interpreted as 64 The Rx FIFO 1 elements are indexed from 0 to MCAN_RXF1C[22-16] F1S - 1." range="22:16" rwaccess="R/W"/>
	<bitfield id="F1SA" width="13" begin="14" end="2" resetval="0x0" description="Rx FIFO 1 Start Address Start address of Rx FIFO 1 in Message RAM (32-bit word address, see Message RAM Configuration)." range="14:2" rwaccess="R/W"/>
	</register><register id="CFG_RXF1S" acronym="CFG_RXF1S" offset="692" width="32" description="Rx FIFO 1 Status register. FIFO 1 message lost/full indication, put index, get index and fill level.">
		<bitfield id="RF1L" width="1" begin="25" end="25" resetval="0x0" description="Rx FIFO 1 Message Lost This bit is a copy of interrupt flag MCAN_IR[7] RF1L. When the MCAN_IR[7] RF1L flag is reset, this bit is also reset. 1'b0 = No Rx FIFO 1 message lost 1'b1 = Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of size zero Note: OverWriting the oldest message when the MCAN_RXF1C[31] F1OM = 1'b1 will not set this flag." range="25" rwaccess="R"/>
	<bitfield id="F1F" width="1" begin="24" end="24" resetval="0x0" description="Rx FIFO 1 Full" range="24" rwaccess="R"/>
	<bitfield id="F1PI" width="6" begin="21" end="16" resetval="0x0" description="Rx FIFO 1 Put Index" range="21:16" rwaccess="R"/>
	<bitfield id="F1GI" width="6" begin="13" end="8" resetval="0x0" description="Rx FIFO 1 Get Index" range="13:8" rwaccess="R"/>
	<bitfield id="F1FL" width="7" begin="6" end="0" resetval="0x0" description="Rx FIFO 1 Fill Level" range="6:0" rwaccess="R"/>
	</register><register id="CFG_RXF1A" acronym="CFG_RXF1A" offset="696" width="32" description="Rx FIFO 1 Acknowledge register. FIFO 1 acknowledge last index of read buffers, updates get index and fill level.">
		<bitfield id="F1AI" width="6" begin="5" end="0" resetval="0x0" description="Rx FIFO 1 Acknowledge Index After the Host CPU has read a message or a sequence of messages from Rx FIFO 1 it has to write the buffer index of the last element read from Rx FIFO 1 to the MCAN_RXF1A[5-0] F1AI field. This will set the Rx FIFO 1 Get Index MCAN_RXF1S[13-8] F1GI field to the MCAN_RXF1A[5-0] F1AI field + 1 and update the FIFO 1 Fill Level MCAN_RXF1S[6-0] F1FL field." range="5:0" rwaccess="R/W"/>
	</register><register id="CFG_RXESC" acronym="CFG_RXESC" offset="700" width="32" description="Rx Buffer/FIFO Element Size Configuration register. Configure data field size for storage of accepted frames.">
		<bitfield id="RBDS" width="3" begin="10" end="8" resetval="0x0" description="Rx Buffer data Field Size 3'b000 = 8 byte data field 3'b001 = 12 byte data field 3'b010 = 16 byte data field 3'b011 = 20 byte data field 3'b100 = 24 byte data field 3'b101 = 32 byte data field 3'b110 = 48 byte data field 3'b111 = 64 byte data field" range="10:8" rwaccess="R/W"/>
	<bitfield id="F1DS" width="3" begin="6" end="4" resetval="0x0" description="Rx FIFO 1 Data Field Size 3'b000 = 8 byte data field 3'b001 = 12 byte data field 3'b010 = 16 byte data field 3'b011 = 20 byte data field 3'b100 = 24 byte data field 3'b101 = 32 byte data field 3'b110 = 48 byte data field 3'b111 = 64 byte data field" range="6:4" rwaccess="R/W"/>
	<bitfield id="F0DS" width="3" begin="2" end="0" resetval="0x0" description="Rx FIFO 0 Data Field Size 3'b000 = 8 byte data field 3'b001 = 12 byte data field 3'b010 = 16 byte data field 3'b011 = 20 byte data field 3'b100 = 24 byte data field 3'b101 = 32 byte data field 3'b110 = 48 byte data field 3'b111 = 64 byte data field Note: In case the data field size of an accepted CAN frame exceeds the data field size configured for the matching Rx Buffer or Rx FIFO, only the number of bytes as configured by the MCAN_RXESC register are stored to the Rx Buffer respectively Rx FIFO element. The rest of the frame's data field is ignored." range="2:0" rwaccess="R/W"/>
	</register><register id="CFG_TXBC" acronym="CFG_TXBC" offset="704" width="32" description="Tx Buffer Configuration register. Configure Tx FIFO/Queue mode, Tx FIFO/Queue size, number of dedicated Tx buffers, Tx buffer start address.">
		<bitfield id="TFQM" width="1" begin="30" end="30" resetval="0x0" description="Tx FIFO/Queue Mode 1'b0 = Tx FIFO operation 1'b1 = Tx Queue operation" range="30" rwaccess="R"/>
	<bitfield id="TFQS" width="6" begin="29" end="24" resetval="0x0" description="Transmit FIFO/Queue Size 6'h00 = No Tx FIFO/Queue 6'b01-6'h20 (1-32) = Number of Tx Buffers used for Tx FIFO/Queue > 6'h20 (32) = Values greater than 32 are interpreted as 32" range="29:24" rwaccess="R"/>
	<bitfield id="NDTB" width="6" begin="21" end="16" resetval="0x0" description="Number of Dedicated Transmit Buffers 6'h00 = No Dedicated Tx Buffers 6'h01-6'h20 (1-32) = Number of Dedicated Tx Buffers > 6'h20 (32) = Values greater than 32 are interpreted as 32" range="21:16" rwaccess="R"/>
	<bitfield id="TBSA" width="14" begin="15" end="2" resetval="0x0" description="Tx Buffers Start Address Start address of Tx Buffers section in Message RAM (32-bit word address, see Message RAM Configuration). Note: Be aware that the sum of the MCAN_TXBC[29-24] TFQS and MCAN_TXBC[21-16] NDTB fields may be not greater than 32. There is no check for erroneous configurations. The Tx Buffers section in the Message RAM starts with the dedicated Tx Buffers." range="15:2" rwaccess="R"/>
	</register><register id="CFG_TXFQS" acronym="CFG_TXFQS" offset="708" width="32" description="Tx FIFO/Queue Status register. Tx FIFO/Queue full indication and put index, Tx FIFO get index and fill level. The Tx FIFO/Queue status is related to the pending Tx requests listed in the MCAN_TXBRP register. Therefore the effect of Add/Cancellation requests may be delayed due to a running Tx scan (the MCAN_TXBRP register not yet updated).">
		<bitfield id="TFQF" width="1" begin="21" end="21" resetval="0x0" description="Tx FIFO/Queue Full" range="21" rwaccess="R"/>
	<bitfield id="TFQPI" width="5" begin="20" end="16" resetval="0x0" description="Tx FIFO/Queue Put Index" range="20:16" rwaccess="R"/>
	<bitfield id="TFGI" width="5" begin="12" end="8" resetval="0x0" description="Tx Queue Get Index" range="12:8" rwaccess="R"/>
	<bitfield id="TFFL" width="6" begin="5" end="0" resetval="0x0" description="Tx FIFO Free Level. Number of consecutive free Tx FIFO elements starting from the MCAN_TXFQS[12-8] TFGI field, range 0 to 32. Read as zero when Tx Queue operation is configured (MCAN_TXBC[30] TFQM = 1'b1). Note: In case of mixed configurations where dedicated Tx Buffers are combined with a Tx FIFO or a Tx Queue, the Put and Get Indices indicate the number of the Tx Buffer starting with the first dedicated Tx Buffers." range="5:0" rwaccess="R"/>
	</register><register id="CFG_TXESC" acronym="CFG_TXESC" offset="712" width="32" description="Tx Buffer Element Size Configuration register. ConfigurationConfigure data field size for frame transmission. Configures the number of data bytes belonging to a Tx Buffer element. Data field sizes > 8 bytes are intended for CAN FD operation only.">
		<bitfield id="TBDS" width="3" begin="2" end="0" resetval="0x0" description="Tx Buffer Data Field Size 3'b000 = 8 byte data field 3'b001 = 12 byte data field 3'b010 = 16 byte data field 3'b011 = 20 byte data field 3'b100 = 24 byte data field 3'b101 = 32 byte data field 3'b110 = 48 byte data field 3'b111 = 64 byte data field Note: In case the data length code DLC of a Tx Buffer element is configured to a value higher than the Tx Buffer data field size MCAN_TXESC[2-0] TBDS, the bytes not defined by the Tx Buffer are transmitted as CCh (padding bytes)." range="2:0" rwaccess="R/W"/>
	</register><register id="CFG_TXBRP" acronym="CFG_TXBRP" offset="716" width="32" description="Tx Buffer Request Pending register. PendingTx buffers with pending transmission request. Each Tx Buffer has its own Transmission Request Pending bit. The bits are set via the MCAN_TXBAR register. The bits are reset after a requested transmission has completed or has been cancelled via the MCAN_TXBCR register. The MCAN_TXBRP bits are set only for those Tx Buffers configured via the MCAN_TXBC register. After a MCAN_TXBRP bit has been set, a Tx scan (see Tx Handling) is started to check for the pending Tx request with the highest priority (Tx Buffer with lowest Message ID).">
		<bitfield id="TRP" width="32" begin="31" end="0" resetval="0x0" description="Transmission Request Pending" range="31:0" rwaccess="R"/>
	</register><register id="CFG_TXBAR" acronym="CFG_TXBAR" offset="720" width="32" description="Tx Buffer Add Request register. Add transmission requests. Each Tx Buffer has its own Add Request bit. Writing 1h will set the corresponding Add Request bit; writing a 0h has no impact. This enables the Host CPU to set transmission requests for multiple Tx Buffers with one write to the MCAN_TXBAR register. The MCAN_TXBAR bits are set only for those Tx Buffers configured via the MCAN_TXBC register. When no Tx scan is running, the bits are reset immediately, else the bits remain set until the Tx scan process has completed. Note: If an add request is applied for a Tx Buffer with pending transmission request (corresponding MCAN_TXBRP bit already set), this add request is ignored.">
		<bitfield id="AR" width="32" begin="31" end="0" resetval="0x0" description="Add request" range="31:0" rwaccess="R/W0TC"/>
	</register><register id="CFG_TXBCR" acronym="CFG_TXBCR" offset="724" width="32" description="Tx Buffer Cancellation Request register. Request cancellation of pending transmissions. Each Tx Buffer has its own Cancellation Request bit. Writing a 1h will set the corresponding Cancellation Request bit; writing a 0h has no impact. This enables the Host CPU to set cancellation requests for multiple Tx Buffers with one write to the MCAN_TXBCR register. The MCAN_TXBCR bits are set only for those Tx Buffers configured via the MCAN_TXBC register. The bits remain set until the corresponding bit of the MCAN_TXBRP register is reset.">
		<bitfield id="CR" width="32" begin="31" end="0" resetval="0x0" description="Cancellation Request" range="31:0" rwaccess="R/W0TC"/>
	</register><register id="CFG_TXBTO" acronym="CFG_TXBTO" offset="728" width="32" description="Tx Buffer Transmission Occurred register. Signals successful transmissions, set when corresponding MCAN_TXBRP flag is cleared. Each Tx Buffer has its own Transmission Occurred bit. The bits are set when the corresponding MCAN_TXBRP bit is cleared after a successful transmission. The bits are reset when a new transmission is requested by writing a 1h to the corresponding bit of register the MCAN_TXBAR register.">
		<bitfield id="TO" width="32" begin="31" end="0" resetval="0x0" description="Transmission Occurred" range="31:0" rwaccess="R"/>
	</register><register id="CFG_TXBCF" acronym="CFG_TXBCF" offset="732" width="32" description="Tx Buffer Cancellation Finished register. Signals successful transmit cancellation, set when corresponding MCAN_TXBRP flag is cleared after cancellation request. Each Tx Buffer has its own Cancellation Finished bit. The bits are set when the corresponding MCAN_TXBRP bit is cleared after a cancellation was requested via the MCAN_TXBCR register. In case the corresponding MCAN_TXBRP bit was not set at the point of cancellation, MCAN_TXBCF[n] CF bit is set immediately. The bits are reset when a new transmission is requested by writing a 1h to the corresponding bit of the MCAN_TXBAR register.">
		<bitfield id="CF" width="32" begin="31" end="0" resetval="0x0" description="Cancellation Finished" range="31:0" rwaccess="R"/>
	</register><register id="CFG_TXBTIE" acronym="CFG_TXBTIE" offset="736" width="32" description="Tx Buffer Transmission Interrupt Enable register. Enable transmit interrupts for selected Tx buffers.">
		<bitfield id="TIE" width="32" begin="31" end="0" resetval="0x0" description="Transmission Interrupt Enable" range="31:0" rwaccess="R/W"/>
	</register><register id="CFG_TXBCIE" acronym="CFG_TXBCIE" offset="740" width="32" description="Tx Buffer Cancellation Finished Interrupt Enable register. Enable cancellation finished interrupts for selected Tx buffers.">
		<bitfield id="CFIE" width="32" begin="31" end="0" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="31:0" rwaccess="R/W"/>
	</register><register id="CFG_TXEFC" acronym="CFG_TXEFC" offset="752" width="32" description="Tx Event FIFO Configuration register. Tx event FIFO watermark, size and start address.">
		<bitfield id="EFWM" width="6" begin="29" end="24" resetval="0x0" description="Event FIFO Watermark 6'h00 = Watermark interrupt disabled 6'h01-6'h20 (1-32) = Level for Tx Event FIFO watermark interrupt (MCAN_IR[13] TEFW)  > 6'h20 (32) = Watermark interrupt disabled" range="29:24" rwaccess="R/W"/>
	<bitfield id="EFS" width="6" begin="21" end="16" resetval="0x0" description="Event FIFO Size 6'h00 = Tx Event FIFO disabled 6'h01-6'h20 (1-32) = Number of Tx Event FIFO elements > 6'h20 (32) = Values greater than 32 are interpreted as 32 The Tx Event FIFO elements are indexed from 0 to MCAN_TXEFC[21-16] EFS field - 1." range="21:16" rwaccess="R/W"/>
	<bitfield id="EFSA" width="14" begin="15" end="2" resetval="0x0" description="Event FIFO Start Address Start address of Tx Event FIFO in Message RAM (32-bit word address, see Message RAM Configuration)." range="15:2" rwaccess="R/W"/>
	</register><register id="CFG_TXEFS" acronym="CFG_TXEFS" offset="756" width="32" description="Tx Event FIFO Status register. Tx event FIFO element lost/full indication, put index, get index, and fill level.">
		<bitfield id="TEFL" width="1" begin="25" end="25" resetval="0x0" description="Tx Event FIFO Element Lost This bit is a copy of interrupt flag MCAN_IR[15] TEFL. When the MCAN_IR[15] TEFL flag is reset, this bit is also reset. 1'b0 = No Tx Event FIFO element lost 1'b1 = Tx Event FIFO element lost, also set after write attempt to Tx Event FIFO of size zero." range="25" rwaccess="R"/>
	<bitfield id="EFF" width="1" begin="24" end="24" resetval="0x0" description="Event FIFO Full" range="24" rwaccess="R"/>
	<bitfield id="EFPI" width="5" begin="20" end="16" resetval="0x0" description="Event FIFO Put Index" range="20:16" rwaccess="R"/>
	<bitfield id="EFGI" width="5" begin="12" end="8" resetval="0x0" description="Event FIFO Get Index" range="12:8" rwaccess="R"/>
	<bitfield id="EFFL" width="6" begin="5" end="0" resetval="0x0" description="Event FIFO FIll Level" range="5:0" rwaccess="R"/>
	</register><register id="CFG_TXEFA" acronym="CFG_TXEFA" offset="760" width="32" description="Tx Event FIFO Acknowledge register. Tx event FIFO acknowledge last index of read elements, updates get index and fill level.">
		<bitfield id="EFAI" width="5" begin="4" end="0" resetval="0x0" description="Event FIFO Acknowledge Index After the Host CPU has read an element or a sequence of elements from the Tx Event FIFO it has to write the index of the last element read from Tx Event FIFO to the MCAN_TXEFA[4-0] EFAI field. This will set the Tx Event FIFO Get Index MCAN_TXEFS[12-8] EFGI field to the MCAN_TXEFA[4-0] EFAI field + 1 and update the Event FIFO Fill Level MCAN_TXEFS[5-0] EFFL field." range="4:0" rwaccess="R"/>
	</register>
</module>